let thisobj = async (登出 = true) => {

    // 初始化
    await require('../api')();

    /**
     * 法兰城启动，或者设置登出到法兰城(要求登陆点在法兰城)
     */
    信息提示(`\n执行脚本：开始|${登出 == true ? '登出回城，' : ''}去法兰城银行`)

    if(!['法兰城', '银行'].includes(获取地图名称())) {
        信息提示(`\n执行脚本：失败|请在法兰城内启动脚本或者设置登陆点在法兰城。|${登出 == true ? '登出回城，' : ''}法兰城银行`)
        return;
    }

    let 传送门 = require('./法兰城_传送石');
    while(获取地图名称() != '银行') {
        await 传送门('东门', 登出, {x: 238, y: 111});
        await 等待(1000);
    }

    信息提示(`\n执行脚本：成功|${登出 == true ? '登出回城，' : ''}去法兰城银行`)
};

module.exports = thisobj;