require('../api').then(async (cga) => {

    await 设置高速移动();
    await 设置高速切图();
    await 设置高速采集();
    await 设置自动补给();
    await 设置说话防掉线();
    await 设置自动丢物品(['卡片？']);
    await 设置自动叠加物品(['地的水晶碎片|999', '水的水晶碎片|999', '火的水晶碎片|999', '风的水晶碎片|999',]);
    await 设置高速战斗();
    await 设置自动战斗();
    await 设置战斗宠物二动();

    // beta 战斗设置
    await 设置自动战斗逃跑();

    信息提示('\n-----------------完成所有初始化配置，开始运行脚本---------------------------');

    let 拥有死者戒指 = await 获取指定物品('死者的戒指');
    while(await 获取地图名称() == '召唤之间' && !拥有死者戒指) {
        await 自动寻路(18, 6);
        await 等待(1000);
        await 对话NPC(19, 6, ['是', '下一步', '确定', '下一步', '是', '下一步', '确定']);
        await 等待(1000);
    }

    while(await 获取地图名称() == '回廊' && !拥有死者戒指) {
        await 自动寻路(23, 19, true);
        await 等待(3000);
    }


    while(await 获取地图名称() == '灵堂' && !拥有死者戒指) {
        await 自动寻路(53, 2);
        await 等待(1000);
        await 对话NPC(54, 2, ['是', '确定']);
        await 等待(1000);
        拥有死者戒指 = await 获取指定物品('死者的戒指');
    }

    // 拥有死者戒指, 开始往回走
    while(await 获取地图名称() == '灵堂' && 拥有死者戒指) {
        await 自动寻路(31, 48, true);
        await 等待(1000);
    }

    while(await 获取地图名称() == '回廊' && 拥有死者戒指) {
        await 自动寻路(44, 15, true);
        await 等待(1000);
    }

    while(await 获取地图名称() == '召唤之间' && 拥有死者戒指) {
        await 自动寻路(18, 6);
        await 等待(1000);
        await 对话NPC(19, 6, ['下一步', '下一步', '确定']);
        await 等待(1000);
    }

    let 拥有赏赐状 = await 获取指定物品('赏赐状');
    while(await 获取地图名称() == '谒见之间' && !拥有赏赐状) {
        await 自动寻路(7, 4);
        await 等待(1000);
        await 对话NPC(7, 3, ['确定']);
        await 等待(1000);
        拥有赏赐状 = await 获取指定物品('赏赐状');
    }

    while(await 获取地图名称() == '谒见之间' && 拥有赏赐状) {
        await 自动寻路(8, 19, true);
        await 等待(1000);
    }

    while(await 获取地图名称() == '里谢里雅堡 2楼' && 拥有赏赐状) {
        await 自动寻路(47, 78, true);
        await 等待(1000);
        await 对话NPC(47, 79, ['确定', '确定']);
        await 等待(1000);
        拥有赏赐状 = await 获取指定物品('赏赐状');
    }

    信息提示('\n-----------------完成国民任务，结束运行脚本---------------------------');
    await 登出回城();
});