let 永不遗忘的爱 = async (是否需要初始化 = true) => require('../api')().then(async () => {

    if (是否需要初始化) {
        await 设置高速移动();
        await 设置高速切图();
        await 设置高速采集();
        await 设置自动补给();
        await 设置说话防掉线();
        await 设置自动丢物品(['卡片？', '魔石', '设计图？']);
        await 设置自动叠加物品(['地的水晶碎片|999', '水的水晶碎片|999', '火的水晶碎片|999', '风的水晶碎片|999',]);
        await 设置高速战斗();
        await 设置自动战斗();
        // await 设置战斗宠物二动();
    }

    // 加载通用模块
    let 法兰传送石 = require('../通用模块/法兰城_传送石');
    let 传送去亚留特村 = require('../通用模块/法兰城_启程之间');

    let 刷子次数 = 0, 开始时间 = Date.now();

    while (await 获取物品数量() < 20 ) {
        信息提示('\n-----------------完成所有初始化配置，开始运行脚本---------------------------');
        while (await 获取地图名称() == '法兰城' && !(await 获取指定物品('绿色口臭鬼的毒液'))) {
            await 法兰传送石('东门');
            await 自动寻路(181, 36, true);
            await 等待(1000);
        }

        while (await 获取地图名称() == '国民屋' && !(await 获取指定物品('绿色口臭鬼的毒液')) && !(await 获取指定物品('“究极盗梦”术')) && !(await 获取指定物品('未婚夫的照片'))) {
            await 自动寻路(16, 14);
            await 对话NPC(16, 13, ['下一步', '是', '确定']);
            await 等待(1000);
        }

        while (await 获取地图名称() == '国民屋' && await 获取指定物品('绿色口臭鬼的毒液')) {
            await 自动寻路(16, 25, true);
            await 等待(1000);
        }

        while (await 获取地图名称() == '法兰城' && await 获取指定物品('绿色口臭鬼的毒液')) {
            await 自动寻路(153, 70, true);
            await 等待(1000);
        }

        while (await 获取地图名称() == '里谢里雅堡' && await 获取指定物品('绿色口臭鬼的毒液')) {
            await 自动寻路(41, 50, true);
            await 等待(1000);
        }

        while (await 获取地图名称() == '里谢里雅堡 1楼' && await 获取指定物品('绿色口臭鬼的毒液')) {
            await 自动寻路(75, 19, true);
            await 等待(1000);
        }

        while (await 获取地图名称() == '里谢里雅堡 2楼' && await 获取指定物品('绿色口臭鬼的毒液')) {
            await 自动寻路(0, 75, true);
            await 等待(1000);
        }

        while (await 获取地图名称() == '图书室' && await 获取指定物品('绿色口臭鬼的毒液')) {
            await 自动寻路(18, 28);
            await 对话NPC(18, 29, ['下一步', '确定']);
            await 等待(1000);
        }

        while (await 获取地图名称() == '图书室' && await 获取指定物品('介绍信')) {
            await 自动寻路(29, 18, true);
            await 等待(1000);
        }

        while (await 获取地图名称() == '里谢里雅堡 2楼' && await 获取指定物品('介绍信')) {
            await 自动寻路(49, 80, true);
            await 等待(1000);
        }

        while (await 获取地图名称() == '里谢里雅堡 1楼' && await 获取指定物品('介绍信')) {
            await 自动寻路(45, 20, true);
            await 等待(1000);
        }

        while (await 获取地图名称() == '启程之间' && await 获取指定物品('介绍信')) {
            await 自动寻路(43, 43);
            await 对话NPC(44, 43, ['是']);
            await 等待(1000);
        }

        while (await 获取地图名称() == '圣拉鲁卡村的传送点' && await 获取指定物品('介绍信')) {
            await 自动寻路(7, 3, true);
            await 等待(1000);
        }

        while (await 获取地图名称() == '村长的家' && await 获取指定物品('介绍信')) {
            await 自动寻路(2, 9, true);
            await 等待(1000);
        }

        while (await 获取地图名称() == '圣拉鲁卡村' && await 获取指定物品('介绍信')) {
            await 自动寻路(41, 35);
            await 对话NPC(42, 35, ['下一步', '下一步', '下一步', '是', '确定']);
            await 等待(1000);
        }

        while (await 获取地图名称() == '圣拉鲁卡村' && await 获取指定物品('“究极盗梦”术')) {
            await 登出回城();
            await 等待(1000);
        }

        while (await 获取地图名称() == '法兰城' && await 获取指定物品('“究极盗梦”术')) {
            while (await 获取地图名称() != '国民屋') {
                await 法兰传送石('东门', true, { x: 221, y: 83 });
                await 自动寻路(7, 33);
                await 对话NPC(6, 33, []);
                await 等待(3000);
                await 自动寻路(12, 42, true);
                await 等待(1000);
                await 自动寻路(181, 36, true);
                await 等待(1000);
            }
        }

        while (await 获取地图名称() == '国民屋' && await 获取指定物品('“究极盗梦”术')) {
            await 自动寻路(16, 14);
            await 对话NPC(16, 13, ['确定', '确定']);
            await 等待(1000);
        }

        while (await 获取地图名称() == '梦境之奇利村') {
            await 自动寻路(58, 45, true);
            await 等待(1000);
        }

        while (await 获取地图名称() == '梦境之索奇亚') {
            await 自动寻路(202, 236);
            await 对话NPC(202, 235, ['确定']);
            await 等待战斗结束();
            await 等待(1000);
        }

        while (await 获取地图序号() == '57422') {
            await 自动寻路(45, 7, true);
            await 等待(1000);
        }

        while (await 获取地图序号() == '57423') {
            await 自动寻路(32, 72, true);
            await 等待(1000);
        }

        while (await 获取地图序号() == '57424') {
            await 自动寻路(28, 16, true);
            await 等待(1000);
        }

        while (await 获取地图序号() == '57425') {
            await 自动寻路(38, 9, true);
            await 等待(1000);
        }

        while (await 获取地图序号() == '57426') {
            await 自动寻路(20, 12, true);
            await 等待(1000);
        }

        while (await 获取地图序号() == '57427') {
            await 自动寻路(37, 24);
            await 对话NPC(37, 23, ['确定']);
            await 等待战斗结束();
            await 等待(1000);
        }

        while (await 获取地图序号() == '57428') {
            await 对话NPC(37, 23, ['下一步', '下一步', '确定']);
            await 等待(1000);
        }

        while (await 获取地图名称() == '国民屋' && await 获取指定物品('未婚夫的照片')) {
            await 对话NPC(16, 13, ['下一步', '下一步', '下一步', '下一步', '确定']);
            await 等待(1000);
        }

        刷子次数 = 刷子次数 + 1;
        let 总共耗时 = Math.floor((Date.now() - 开始时间) / 60000);
        信息提示('\n-----------------完成永不遗忘的爱任务，结束运行脚本---------------------------');
        信息提示(`\n-----------------共完成【${刷子次数}】次, 耗时：${总共耗时}分钟, 平均每轮耗时：${Math.floor(总共耗时 / 回合数)}分钟---------------------------`);
    }
});

let 导出模块 = () => {
    if (process.argv[1] === __filename) {
        永不遗忘的爱(true);
    }
    return 永不遗忘的爱;
}
module.exports = 导出模块();